export default {
  projections: {
    РегРезультE: {
      датРегРезСобес: {
        __caption__: 'Дата регистрации результатов собеседования'
      }
    },
    РегРезультL: {
      датРегРезСобес: {
        __caption__: 'Дата регистрации результатов собеседования'
      },
      организация: {
        __caption__: 'Наименование организации',
        наименование: {
          __caption__: 'Наименование организации'
        }
      },
      планирСобес: {
        __caption__: 'ФИО кандидата',
        регистАнкеты: {
          __caption__: '',
          фИОКандидата: {
            __caption__: 'ФИО кандидата'
          },
          вакантДолжн: {
            __caption__: '',
            должности: {
              __caption__: 'Вакантная должность'
            }
          }
        }
      },
      сотрудники: {
        __caption__: 'Имя участника собеседования',
        фИОСотруд: {
          __caption__: 'Имя участника собеседования'
        },
        должнСотр: {
          __caption__: '',
          должность: {
            __caption__: 'Должность участника собеседования'
          }
        }
      }
    }
  },
  validations: {
    датРегРезСобес: {
      __caption__: 'Дата регистрации результатов собеседования'
    },
    организация: {
      __caption__: 'Наименование организации'
    },
    планирСобес: {
      __caption__: 'ФИО кандидата'
    },
    сотрудники: {
      __caption__: 'Имя участника собеседования'
    },
    тЧРегРезульт: {
      __caption__: 'тЧРегРезульт'
    }
  }
};
